[
    {
        "projectName" : "Valoguessr",
        "previewDescription" : "My proudest creation, A mashup between Valorant and Geoguessr!",
        "previewImage" : "Img/Valoguessr1.png",
        "rating" : 10,
        "date" :  20230518,
        "learned" : "During the development of valoguessr I learned a lot about web development, like: html, css, js, hosting websites, ssl certificates, advertisements and a lot more",
        "headerImg" : "Img/Valoguessr2.png",
        "headerText" : "Valoguessr is a passion project of mine that I once thought of and really wanted to make. It is basically a mix between Valorant the hero shooter and Geoguessr the steet view web game. I decided to basically learn web dev from scratch just to be able to create this website for people to enjoy playing. I had a lot of issues during the way and it took me quite a long time as I worked on it in my spare time. I am extremely happy with the result as the valorant community responded amazingly to the website!",
        "img1" : "Img/Valoguessr3.png",
        "paragraph1" : "",
        "img2" : "Img/Valoguessr4.png",
        "paragraph2" : "This picture shows all of the different game settings / modifiers that you can adjust to change the way the game works!",
        "img3" : "Img/Valoguessrold.png",
        "paragraph3" : "Here you can see Valoguessr 1.0 I decided to completely remake it for the current version to add more modes, better responsiveness , and to competely redo the UI.",
        "link" : "https://valoguessr.com"
    },
    {
        "projectName" : "Gearz",
        "previewDescription" : "2D platformer made as a school project along with artists.",
        "previewImage" : "Img/Gearz1.png",
        "rating" : 7,
        "date" :  20230405,
        "learned" : "I learned how to use github as a team and how to communicate along with the artists who made the game assets / art for us.",
        "headerImg" : "Img/Gearz2.png",
        "headerText" : "Gearz is a 2D platformer that I had to make for a school project to put on an arcade cabin. You play as a robot who can , jump, dash, slide and slash. You have to get trough multiple different enemies while charging yourself up at recharge stations.",
        "img1" : "Img/Gears3.png",
        "paragraph1" : "This is a screenshot of the game, you can see an enemy in the bottom, a platform on the left, your lifes in the top left and your battery % in the top right.",
        "img2" : "",
        "paragraph2" : "",
        "img3" : "",
        "paragraph3" : "",
        "link" : "https://github.com/IAm2XTr33M/Gearz"
    },
    {
        "projectName" : "Ghost hunter",
        "previewDescription" : "C# Console game",
        "previewImage" : "Img/GhostHunter.png",
        "rating" : 7,
        "date" :  20230123,
        "learned" : "During this project I learned the meaning of object oriented programming and I learned what classes are and how valuable they are.",
        "headerImg" : "Img/GhostHunter2.png",
        "headerText" : "Ghost Hunter is a console game made for a school assignment where I had to made a text based (adventure) game using only the console. I ended up making a game where you have to move trough a haunted house collecting keys and getting rid of ghosts all while having to solve small riddles to know which way you have to go.",
        "img1" : "Img/GhostHunter3.png",
        "paragraph1" : "",
        "img2" : "Img/GhostHunter.png",
        "paragraph2" : "The gameplay lets you move trough rooms using the arrow keys, it will give a short description for each room, you can get rid of a ghost in the room by pressing space, the goal is to go to the final room!",
        "img3" : "",
        "paragraph3" : "",
        "link" : "https://github.com/IAm2XTr33M/Console-Text-Based-Game-Kyan-Mensen"
    }
]

