[
    {
        "projectName" : "Valoguessr",
        "previewDescription" : "My proudest creation, A mashup between Valorant and Geoguessr!",
        "previewImage" : "img/Valoguessr1.png",
        "rating" : 10,
        "date" :  20230518,
        "learned" : "During the development of valoguessr I learned a lot about web development, like: html, css, js, hosting websites, ssl certificates, advertisements and a lot more",
        "headerImg" : "img/Valoguessr2.png",
        "headerText" : "Valoguessr is a passion project of mine that I once thought of and really wanted to make. It is basically a mix between Valorant the hero shooter and Geoguessr the steet view web game. I decided to basically learn web dev from scratch just to be able to create this website for people to enjoy playing. I had a lot of issues during the way and it took me quite a long time as I worked on it in my spare time. I am extremely happy with the result as the valorant community responded amazingly to the website!",
        "img1" : "img/Valoguessr3.png",
        "paragraph1" : "",
        "img2" : "img/Valoguessr4.png",
        "paragraph2" : "This picture shows all of the different game settings / modifiers that you can adjust to change the way the game works!",
        "img3" : "img/Valoguessrold.png",
        "paragraph3" : "Here you can see Valoguessr 1.0 I decided to completely remake it for the current version to add more modes, better responsiveness , and to competely redo the UI.",
        "link" : "https://valoguessr.com"
    },
    {
        "projectName" : "Gearz",
        "previewDescription" : "2D platformer made as a school project along with artists.",
        "previewImage" : "img/Gearz1.png",
        "rating" : 6.7,
        "date" :  20230405,
        "learned" : "I learned how to use github as a team and how to communicate along with the artists who made the game assets / art for us.",
        "headerImg" : "img/Gearz2.png",
        "headerText" : "Gearz is a 2D platformer that I had to make for a school project to put on an arcade cabin. You play as a robot who can , jump, dash, slide and slash. You have to get trough multiple different enemies while charging yourself up at recharge stations.",
        "img1" : "img/Gears3.png",
        "paragraph1" : "This is a screenshot of the game, you can see an enemy in the bottom, a platform on the left, your lifes in the top left and your battery % in the top right.",
        "img2" : "",
        "paragraph2" : "",
        "img3" : "",
        "paragraph3" : "",
        "link" : "https://github.com/IAm2XTr33M/Gearz"
    },
    {
        "projectName" : "Ghost hunter",
        "previewDescription" : "C# Console game",
        "previewImage" : "img/GhostHunter.png",
        "rating" : 6.2,
        "date" :  20230123,
        "learned" : "During this project I learned the meaning of object oriented programming and I learned what classes are and how valuable they are.",
        "headerImg" : "img/GhostHunter2.png",
        "headerText" : "Ghost Hunter is a console game made for a school assignment where I had to made a text based (adventure) game using only the console. I ended up making a game where you have to move trough a haunted house collecting keys and getting rid of ghosts all while having to solve small riddles to know which way you have to go.",
        "img1" : "img/GhostHunter3.png",
        "paragraph1" : "",
        "img2" : "img/GhostHunter.png",
        "paragraph2" : "The gameplay lets you move trough rooms using the arrow keys, it will give a short description for each room, you can get rid of a ghost in the room by pressing space, the goal is to go to the final room!",
        "img3" : "",
        "paragraph3" : "",
        "link" : "https://github.com/IAm2XTr33M/Console-Text-Based-Game-Kyan-Mensen"
    },
    {
        "projectName" : "Visual Colliders", "titleHeight" : "30%" , "titleLineHeight" : "90%" ,
        "previewDescription" : "A unity editor tool that helps visualise colliders",
        "previewImage" : "img/VisualColliders3.png",
        "rating" : 8,
        "date" :  20231114,
        "learned" : "During this project I learned: Scriptable objects, Rendering meshes trough code using Graphics.Render..... , Custom inspectors, and much more",
        "headerImg" : "img/VisualColliders1.png",
        "headerText" : "I made this tool during my internship time at TinyRoar as they needed a tool to visualise colliders to help create the game, In the end im extremely happy with the result as its quick and easy to use but can visualize / color in your entire scene within seconds exactly how you want.",
        "img1" : "img/VisualColliders2.png",
        "paragraph1" : "I made use of custom scriptable objects where you can add filters to filter certain colliders to color in a different color.",
        "img2" : "img/VisualColliders4.png",
        "paragraph2" : "example of having it on/off",
        "img3" : "img/VisualColliders5.png",
        "paragraph3" : "I made sure it also works with convex meshes",
        "link" : "https://github.com/IAm2XTr33M/VisualCollider"
    }
    ,{
        "projectName" : "Translocator",
        "previewDescription" : "A unity editor tool that can replace / translocate specific objects",
        "previewImage" : "img/Translocator1.png",
        "rating" : 6.8,
        "date" :  20230919,
        "learned" : "During this project I learned a lor about mass searching objects in a scene, searching for all instanced prefabs in a scene, creating a custom editor tool (not custom inspector) and having working buttons in there, how to implement undoing with a command pattern",
        "headerImg" : "img/Translocator3.png",
        "headerText" : "This project is a tool I made during my internship at TinyRoar, they had an issue where they used a tool to draw grass sprites in a scene but each child sprite got put as a child that the grass was drawn on, this tool helped to find all prefabs / gameobjects in the scene and set their parent to one specific gameobject so they could choose to enable/disable all of them quickly and easily. ",
        "img1" : "img/Translocator4.png",
        "paragraph1" : "I was also requested to add the ability to change all selected prefabs / gameobjects to a different prefab (that was better for performance), so I made you able to choose between translocate and replace.",
        "img2" : "img/Translocator5.png",
        "paragraph2" : "The custom inspector I made makes it simple to go trough everything step by step.",
        "img3" : "img/Translocator2.png",
        "paragraph3" : "You are able to search for gameobjects by name of by prefab",
        "link" : "https://github.com/IAm2XTr33M/PrefabTranslocator"
    }
    ,{
        "projectName" : "EventFinder",
        "previewDescription" : "Script that finds unity events that lead to a specific gameobject",
        "previewImage" : "img/EventFinder3.png",
        "rating" : 6.7,
        "date" :  20231021,
        "learned" : "",
        "headerImg" : "img/EventFinder1.png",
        "headerText" : "This is a small tool made to search for events that lead to a specific gameobject. Example of why I made it: there was an issue where a 'door' kept on getting triggered but we didnt know which 'button' opened said door, so using this tool it shows all gameobjects and their event names that can call events on said gameobject.",
        "img1" : "img/EventFinder1.png",
        "paragraph1" : "Small example of a Button(red) and a door(green), and it shows that the door has 3 unity events leading to it",
        "img2" : "img/EventFinder2.png",
        "paragraph2" : "You select which gameobject has an event being called on it, and it will then find all matching events",
        "img3" : "",
        "paragraph3" : "",
        "link" : "https://pastebin.com/m67FTbbf"
    }
    ,{
        "projectName" : "GameJam",
        "previewDescription" : "Small Game I made for a 'gamejam' for my internship.",
        "previewImage" : "img/GameJam1.png",
        "rating" : 7.5,
        "date" :  20231101,
        "learned" : "This project is the first time I ever made anything procedially generated",
        "headerImg" : "img/GameJam2.png",
        "headerText" : "This is a small game that I made as a challange at my internship, the theme was 'the enviourment changes you' , I added special pads on the ground which will give the player different buffs, like speed, jump stamina etc, there is also wind which will drastically change the momentum of the player, Theres also cages which drop fromt the sky which you need to break to escape.",
        "img1" : "img/GameJam5.png",
        "paragraph1" : "",
        "img2" : "img/GameJam4.png",
        "paragraph2" : "",
        "img3" : "img/GameJam3.png",
        "paragraph3" : "I made a procedurally generated endless mode that will continue infinitely, this uses triggers and different section (that get generated randomly with set patterns)",
        "link" : "https://github.com/IAm2XTr33M/Game-Jam"
    }
    ,{
        "projectName" : "QuoteBot",
        "previewDescription" : "Discord bot to save quotes in servers",
        "previewImage" : "img/QuoteBot1.png",
        "rating" : 6.8,
        "date" :  20220907,
        "learned" : "I Learned: Python read/write - saving prefix for each server",
        "headerImg" : "img/QuoteBot2.png",
        "headerText" : "I wanted to learn how to make a discord bot, so I ended up making a bot where you can create quotes (that you or your friends would say) And where you can read all quotes of a specific person, or read specific quotes, I also made it save the time of when that person made the quote. + I coded it so you are able to have a different prefix in every server.",
        "img1" : "img/QuoteBot1.png",
        "paragraph1" : "",
        "img2" : "",
        "paragraph2" : "",
        "img3" : "",
        "paragraph3" : "",
        "link" : "https://github.com/IAm2XTr33M/DiscordQuoteBot"
    }
    ,{
        "projectName" : "Message Bot",
        "previewDescription" : "Discord bot to tell my gf I love her",
        "previewImage" : "img/MessageBot1.png",
        "rating" : 6.9,
        "date" :  20220609,
        "learned" : "I Learned: discord bot's , python, reading/writing txt files",
        "headerImg" : "img/MessageBot1.png",
        "headerText" : "This is a discord bot that I created for my girlfriend, I wanted a way for her to just always be reminded that I love her, It runs every day and every night, It might be a bit corny but I like it.",
        "img1" : "img/MessageBot2.png",
        "paragraph1" : "",
        "img2" : "",
        "paragraph2" : "",
        "img3" : "",
        "paragraph3" : "",
        "link" : "https://replit.com/@IAm2XTr33M/KyanJaeLoveBot#main.py"
    }
    ,{
        "projectName" : "Puzzle Game",
        "previewDescription" : "Small puzzle game for school",
        "previewImage" : "img/PuzzleGame1.png",
        "rating" : 6.5,
        "date" :  20230505,
        "learned" : "I Learned: Paper prototypes",
        "headerImg" : "img/PuzzleGame1.png",
        "headerText" : "During school we had an assignment where we had to make a puzzle game paper prototype , I did this and implemented keys, doors and teleporters, I ended up liking the idea so much that I recreated it in unity.",
        "img1" : "img/PuzzleGame2.png",
        "paragraph1" : "",
        "img2" : "",
        "paragraph2" : "",
        "img3" : "",
        "paragraph3" : "",
        "link" : "https://github.com/IAm2XTr33M/Puzzle-Game"
    }
    ,{
        "projectName" : "Ez Logger",
        "previewDescription" : "C# console app to make logs",
        "previewImage" : "img/EzLogger1.png",
        "rating" : 6.6,
        "date" :  20221107,
        "learned" : "I Learned: C# console file system, Writing, reading, saving data in a txt file",
        "headerImg" : "img/EzLogger1.png",
        "headerText" : "I wanted to try to learn more about C# console applications so I made an app where I can make notes, delete notes , go back to read old notes. I also learned how to save settings in a txt file so the same setting still applies after loading up again (Here I was able to change the color ) I am also proud over the fact you can use navigate the menu easily and it looks pretty good.",
        "img1" : "img/EzLogger2.png",
        "paragraph1" : "",
        "img2" : "",
        "paragraph2" : "I made this to quickly and easily save ideas that were in my mind",
        "img3" : "",
        "paragraph3" : "",
        "link" : "https://github.com/IAm2XTr33M/EzLogger"
    }
    ,{
        "projectName" : "1H TicTacToe",
        "previewDescription" : "1h game challenge",
        "previewImage" : "img/1hTicTacToe1.png",
        "rating" : 4.9,
        "date" :  20221102,
        "learned" : "I Learned: C# , working under pressure, multidimentional arrays",
        "headerImg" : "img/1hTicTacToe1.png",
        "headerText" : "This game was a little game that I made during school, Our teacher gave us 1 hour to make 3 games in total and then we were allowed to go home earlier. I came in 15 minutes to late and decided to just code this on my own instead of in a group. I ended up making this in 50min and I am proud of the result.",
        "img1" : "img/1hTicTacToe2.png",
        "paragraph1" : "",
        "img2" : "",
        "paragraph2" : "when I made this project I was still not very knowledgeable with anything regarding code",
        "img3" : "",
        "paragraph3" : "",
        "link" : "https://github.com/IAm2XTr33M/1H-TicTacToe"
    }
    ,{
        "projectName" : "PONG",
        "previewDescription" : "My first ever coding project :)",
        "previewImage" : "img/Pong1.png",
        "rating" : 6,
        "date" :  20220620,
        "learned" : "I Learned: Unity, C#, coding, variables, unity ínput",
        "headerImg" : "img/Pong1.png",
        "headerText" : "This game was a little game that I made during school, Our teacher gave us 1 hour to make 3 games in total and then we were allowed to go home earlier. I came in 15 minutes to late and decided to just code this on my own instead of in a group. I ended up making this in 50min and I am proud of the result.",
        "img1" : "img/Pong2.png",
        "paragraph1" : "",
        "img2" : "",
        "paragraph2" : "Ofcourse this project is nothing special, but it has a nice place in my heart.",
        "img3" : "",
        "paragraph3" : "",
        "link" : "https://github.com/IAm2XTr33M/Pong"
    }
    ,{
        "projectName" : "ValoGuessr Tools", "titleHeight" : "35%" , "titleLineHeight" : "90%" ,
        "previewDescription" : "tools used to create valoguessr",
        "previewImage" : "img/ValoguessrLevelMaker1.png",
        "rating" : 6.8,
        "date" :  20230717,
        "learned" : "During these project I learned that creating tools to assist the boring work can make it way more fun to do and a lot quicker, I also learned a lot about js and python , like how to make screenshots and save them",
        "headerImg" : "img/ValoguessrLevelMaker1.png",
        "headerText" : "for the making of Valoguessr I had an awefull time grading each level and taking screenshots for them, so just for that I made two tools which helped me by assisting me.",
        "img1" : "img/ValoguessrLevelMaker2.png",
        "paragraph1" : "This Html, JS, CSS page was used to loop trough all images of a set folder and to make it easy for me to grade them and choose what the answer for that image would be.",
        "img2" : "img/ValoguessrScreenshotMaker1.png",
        "paragraph2" : "This is a tool made in python which would automatically save a screenshot to a folder, it makes sure to count up at which one you are. you can go back incase you messed up once aswell. This was a life saviour because I didnt have to manually rename everything anymore",
        "img3" : "",
        "paragraph3" : "",
        "link" : ""
    }
    ,{
        "projectName" : "Vector 5",
        "previewDescription" : "simple tower defence game",
        "previewImage" : "img/Vector5-1.png",
        "rating" : 6.5,
        "date" :  20230506,
        "learned" : "I Learned: Agile working with scrum",
        "headerImg" : "img/Vector5-1.png",
        "headerText" : "Vector 5 is the name of a group I worked with while creating this tower defence game, we worked with scrum using a scrumboard, backlog and multiple sprints.",
        "img1" : "img/Vector5-2.png",
        "paragraph1" : "",
        "img2" : "",
        "paragraph2" : "",
        "img3" : "",
        "paragraph3" : "",
        "link" : "https://github.com/IAm2XTr33M/Vector5"
    }
    ,{
        "projectName" : "Blissfull board",
        "previewDescription" : "Simple aesthetic game made for a school project",
        "previewImage" : "img/BlissfulBoard1.png",
        "rating" : 6.8,
        "date" :  20240605,
        "learned" : "I Learned: Making the game look professional by using post processing",
        "headerImg" : "img/BlissfulBoard2.png",
        "headerText" : "This project was an assignment for school where we were supposed to learn about scriptable objects and post processing, I decided to make a comfy game where the objective is to go around the map collecting coins.",
        "img1" : "img/BlissfulBoard1.png",
        "paragraph1" : "",
        "img2" : "",
        "paragraph2" : "This project is the first time I spent some time on making sure that the aesthetics are good, I spent a bunch of time tweaking the post processing to get something I am happy with.",
        "img3" : "img/BlissfulBoard3.png",
        "paragraph3" : "The objective of the game is to hover to 10 coins in the fastest time possible, the coins randomly get placed somewhere on the map.",
        "link" : "https://github.com/IAm2XTr33M/BlissfullBoard"
    }
    ,{
        "projectName" : "Potted Pal",
        "previewDescription" : "A smart plant pot created with an arduino",
        "previewImage" : "img/PottedPal1.png",
        "rating" : 7.2,
        "date" :  20230621,
        "learned" : "I Learned: Working with arduinos, sensors, arduino IDE and php",
        "headerImg" : "img/PottedPal1.png",
        "headerText" : "This project was for a group assignment where we had to make a 'smart thing' we decided on making a smart plant pot that can sense humidity, heat and light. We wanted to give it a sort of tamagochi screen where it would reflect its current state by expressing its emotions.",
        "img1" : "img/PottedPal3.png",
        "paragraph1" : "here you can see what the face looks like if it is too cold for the plant, it has a bunch of other states like, too hot, too dry, too wet, these faces are all expressed in different ways, and ofcourse when nothing is wrong its just a hapopy pal.",
        "img2" : "img/PottedPal2.png",
        "paragraph2" : "Here you can see the website that was connected to out arduino ESP32 over wifi which made it possible for us to show the plants stats live",
        "img3" : "img/PottedPal4.png",
        "paragraph3" : "Because it was a school project we had to present it and everyone seemed to love it! we even got put as an example project in upcomming years at our school!",
        "link" : "https://github.com/IAm2XTr33M/PottedPal"
    }
    ,{
        "projectName" : "Last Quarter",
        "previewDescription" : "Small 3d Horror game",
        "previewImage" : "img/LastQuarter1.png",
        "rating" : 6.4,
        "date" :  20230801,
        "learned" : "I Learned: how to make a really nice feeling movement system",
        "headerImg" : "img/LastQuarter2.png",
        "headerText" : "During this project we were challanged with a few challanges and had to make a game in a group, during this project I worked on the decoration and the player controller which I am very happy with",
        "img1" : "img/LastQuarter3.png",
        "paragraph1" : "",
        "img2" : "img/LastQuarter1.png",
        "paragraph2" : "",
        "img3" : "",
        "paragraph3" : "",
        "link" : ""
    }
]

